layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  data_param {
    source: "/path/to/caffe-train-lmdb"
    batch_size: 256
    backend: LMDB
  }
}
layer {
  name: "BatchNorm1"
  type: "BatchNorm"
  bottom: "data"
  top: "BatchNorm1"
}
layer {
  name: "ReLU1"
  type: "ReLU"
  bottom: "BatchNorm1"
  top: "BatchNorm1"
}
layer {
  name: "Scale1"
  type: "Scale"
  bottom: "BatchNorm1"
  top: "BatchNorm1"
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "BatchNorm1"
  top: "conv1"
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "BatchNorm2"
  type: "BatchNorm"
  bottom: "pool1"
  top: "BatchNorm2"
}
layer {
  name: "ReLU2"
  type: "ReLU"
  bottom: "BatchNorm2"
  top: "BatchNorm2"
}
layer {
  name: "Scale2"
  type: "Scale"
  bottom: "BatchNorm2"
  top: "BatchNorm2"
}
layer {
  name: "Convolution1"
  type: "Convolution"
  bottom: "BatchNorm2"
  top: "Convolution1"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "BatchNorm3"
  type: "BatchNorm"
  bottom: "Convolution1"
  top: "BatchNorm3"
}
layer {
  name: "ReLU3"
  type: "ReLU"
  bottom: "BatchNorm3"
  top: "BatchNorm3"
}
layer {
  name: "Scale3"
  type: "Scale"
  bottom: "BatchNorm3"
  top: "BatchNorm3"
}
layer {
  name: "Convolution2"
  type: "Convolution"
  bottom: "BatchNorm3"
  top: "Convolution2"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "concat_1_6"
  type: "Concat"
  bottom: "pool1"
  bottom: "Convolution2"
  top: "Concat1"
}
layer {
  name: "BatchNorm4"
  type: "BatchNorm"
  bottom: "Concat1"
  top: "BatchNorm4"
}
layer {
  name: "ReLU4"
  type: "ReLU"
  bottom: "BatchNorm4"
  top: "BatchNorm4"
}
layer {
  name: "Scale4"
  type: "Scale"
  bottom: "BatchNorm4"
  top: "BatchNorm4"
}
layer {
  name: "Convolution3"
  type: "Convolution"
  bottom: "BatchNorm4"
  top: "Convolution3"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "BatchNorm5"
  type: "BatchNorm"
  bottom: "Convolution3"
  top: "BatchNorm5"
}
layer {
  name: "ReLU5"
  type: "ReLU"
  bottom: "BatchNorm5"
  top: "BatchNorm5"
}
layer {
  name: "Scale5"
  type: "Scale"
  bottom: "BatchNorm5"
  top: "BatchNorm5"
}
layer {
  name: "Convolution4"
  type: "Convolution"
  bottom: "BatchNorm5"
  top: "Convolution4"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "concat_1_6"
  type: "Concat"
  bottom: "Concat1"
  bottom: "Convolution4"
  top: "Concat2"
}
layer {
  name: "BatchNorm6"
  type: "BatchNorm"
  bottom: "Concat2"
  top: "BatchNorm6"
}
layer {
  name: "ReLU6"
  type: "ReLU"
  bottom: "BatchNorm6"
  top: "BatchNorm6"
}
layer {
  name: "Scale6"
  type: "Scale"
  bottom: "BatchNorm6"
  top: "BatchNorm6"
}
layer {
  name: "Convolution5"
  type: "Convolution"
  bottom: "BatchNorm6"
  top: "Convolution5"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "BatchNorm7"
  type: "BatchNorm"
  bottom: "Convolution5"
  top: "BatchNorm7"
}
layer {
  name: "ReLU7"
  type: "ReLU"
  bottom: "BatchNorm7"
  top: "BatchNorm7"
}
layer {
  name: "Scale7"
  type: "Scale"
  bottom: "BatchNorm7"
  top: "BatchNorm7"
}
layer {
  name: "Convolution6"
  type: "Convolution"
  bottom: "BatchNorm7"
  top: "Convolution6"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "concat_1_6"
  type: "Concat"
  bottom: "Concat2"
  bottom: "Convolution6"
  top: "Concat3"
}
layer {
  name: "BatchNorm8"
  type: "BatchNorm"
  bottom: "Concat3"
  top: "BatchNorm8"
}
layer {
  name: "ReLU8"
  type: "ReLU"
  bottom: "BatchNorm8"
  top: "BatchNorm8"
}
layer {
  name: "Scale8"
  type: "Scale"
  bottom: "BatchNorm8"
  top: "BatchNorm8"
}
layer {
  name: "Convolution7"
  type: "Convolution"
  bottom: "BatchNorm8"
  top: "Convolution7"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "BatchNorm9"
  type: "BatchNorm"
  bottom: "Convolution7"
  top: "BatchNorm9"
}
layer {
  name: "ReLU9"
  type: "ReLU"
  bottom: "BatchNorm9"
  top: "BatchNorm9"
}
layer {
  name: "Scale9"
  type: "Scale"
  bottom: "BatchNorm9"
  top: "BatchNorm9"
}
layer {
  name: "Convolution8"
  type: "Convolution"
  bottom: "BatchNorm9"
  top: "Convolution8"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "concat_1_6"
  type: "Concat"
  bottom: "Concat3"
  bottom: "Convolution8"
  top: "Concat4"
}
layer {
  name: "BatchNorm10"
  type: "BatchNorm"
  bottom: "Concat4"
  top: "BatchNorm10"
}
layer {
  name: "ReLU10"
  type: "ReLU"
  bottom: "BatchNorm10"
  top: "BatchNorm10"
}
layer {
  name: "Scale10"
  type: "Scale"
  bottom: "BatchNorm10"
  top: "BatchNorm10"
}
layer {
  name: "Convolution9"
  type: "Convolution"
  bottom: "BatchNorm10"
  top: "Convolution9"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "BatchNorm11"
  type: "BatchNorm"
  bottom: "Convolution9"
  top: "BatchNorm11"
}
layer {
  name: "ReLU11"
  type: "ReLU"
  bottom: "BatchNorm11"
  top: "BatchNorm11"
}
layer {
  name: "Scale11"
  type: "Scale"
  bottom: "BatchNorm11"
  top: "BatchNorm11"
}
layer {
  name: "Convolution10"
  type: "Convolution"
  bottom: "BatchNorm11"
  top: "Convolution10"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "concat_1_6"
  type: "Concat"
  bottom: "Concat4"
  bottom: "Convolution10"
  top: "Concat5"
}
layer {
  name: "BatchNorm12"
  type: "BatchNorm"
  bottom: "Concat5"
  top: "BatchNorm12"
}
layer {
  name: "ReLU12"
  type: "ReLU"
  bottom: "BatchNorm12"
  top: "BatchNorm12"
}
layer {
  name: "Scale12"
  type: "Scale"
  bottom: "BatchNorm12"
  top: "BatchNorm12"
}
layer {
  name: "Convolution11"
  type: "Convolution"
  bottom: "BatchNorm12"
  top: "Convolution11"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "BatchNorm13"
  type: "BatchNorm"
  bottom: "Convolution11"
  top: "BatchNorm13"
}
layer {
  name: "ReLU13"
  type: "ReLU"
  bottom: "BatchNorm13"
  top: "BatchNorm13"
}
layer {
  name: "Scale13"
  type: "Scale"
  bottom: "BatchNorm13"
  top: "BatchNorm13"
}
layer {
  name: "Convolution12"
  type: "Convolution"
  bottom: "BatchNorm13"
  top: "Convolution12"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "concat_1_6"
  type: "Concat"
  bottom: "Concat5"
  bottom: "Convolution12"
  top: "denseblock1"
}

